pauth/app/controllers/users_controller.rb

UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "admin0@a.ru"], ["updated_at", "2024-03-01 14:20:18.226010"], ["id", 1]]
---
  def update
    if current_user&.update!(build_attributes(params))