auth/app/models/user.rb

  def self.authenticate(email, password)
    user = User.find_for_authentication(email:)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "admin@a.ru"], ["LIMIT", 1]]